### Task 1

In [2]:
import pandas as pd

In [3]:
autors = pd.DataFrame({"autor_id" : [1, 2, 3],
                       "autor name": ["Тургеньев", "Чехов", "Островский"]})
autors

   autor_id  autor name
0         1   Тургеньев
1         2       Чехов
2         3  Островский

In [4]:
books = pd.DataFrame({"autor_id" : [1, 1, 1, 2, 2, 3, 3],
                      "book_title":['Отцы и дети', 'Рудин', 'Дворянское гнездо',
                                    'Толстый и тонкий', 'Дама с собачкой', 'Гроза',
                                    'Таланты и поклонники'],
                     "prise" : [450, 300, 350, 500, 450, 370, 290]})
books

   autor_id            book_title  prise
0         1           Отцы и дети    450
1         1                 Рудин    300
2         1     Дворянское гнездо    350
3         2      Толстый и тонкий    500
4         2       Дама с собачкой    450
5         3                 Гроза    370
6         3  Таланты и поклонники    290

### Task 2

In [5]:
autors_prise = pd.merge(autors, books, on="autor_id", how="inner")
autors_prise

   autor_id  autor name            book_title  prise
0         1   Тургеньев           Отцы и дети    450
1         1   Тургеньев                 Рудин    300
2         1   Тургеньев     Дворянское гнездо    350
3         2       Чехов      Толстый и тонкий    500
4         2       Чехов       Дама с собачкой    450
5         3  Островский                 Гроза    370
6         3  Островский  Таланты и поклонники    290

### Task 3

In [7]:
top_5 = autors_prise.nlargest(5, "prise")
top_5

   autor_id  autor name         book_title  prise
3         2       Чехов   Толстый и тонкий    500
0         1   Тургеньев        Отцы и дети    450
4         2       Чехов    Дама с собачкой    450
5         3  Островский              Гроза    370
2         1   Тургеньев  Дворянское гнездо    350

In [9]:
autors_unic = autors_prise.groupby("autor name")
max_prise = autors_unic["prise"].max()
max_prise

autor name
Островский    370
Тургеньев     450
Чехов         500
Name: prise, dtype: int64

In [10]:
min_prise = autors_unic["prise"].min()
min_prise

autor name
Островский    290
Тургеньев     300
Чехов         450
Name: prise, dtype: int64

In [11]:
mean_prise = autors_unic["prise"].mean()
mean_prise

autor name
Островский    330.000000
Тургеньев     366.666667
Чехов         475.000000
Name: prise, dtype: float64

In [12]:
autors_stat = pd.merge(min_prise, max_prise, on="autor name", how="inner")
autors_stat = pd.merge(autors_stat, mean_prise,on="autor name", how="inner")
autors_stat

            prise_x  prise_y       prise
autor name
Островский      290      370  330.000000
Тургеньев       300      450  366.666667
Чехов           450      500  475.000000

In [13]:
autors_stat = autors_stat.rename(columns={"prise_x" : "min_prise", "prise_y" : "max_prise", "prise" : "mean_prise"})
autors_stat

            min_prise  max_prise  mean_prise
autor name
Островский        290        370  330.000000
Тургеньев         300        450  366.666667
Чехов             450        500  475.000000

### Task 5

In [14]:
autors_prise["cover"] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
autors_prise

   autor_id  autor name            book_title  prise    cover
0         1   Тургеньев           Отцы и дети    450  твердая
1         1   Тургеньев                 Рудин    300   мягкая
2         1   Тургеньев     Дворянское гнездо    350   мягкая
3         2       Чехов      Толстый и тонкий    500  твердая
4         2       Чехов       Дама с собачкой    450  твердая
5         3  Островский                 Гроза    370   мягкая
6         3  Островский  Таланты и поклонники    290   мягкая

In [24]:
import numpy as np
book_info = autors_prise.drop("autor_id", axis=1)
book_info = pd.pivot_table(book_info, index="autor name", columns="cover", aggfunc=np.sum, fill_value=0)
book_info

            prise
cover      мягкая твердая
autor name
Островский    660       0
Тургеньев     650     450
Чехов           0     950

In [25]:
book_info.to_pickle("book_info.pkl")
book_info_2 = pd.read_pickle("book_info.pkl")
book_info_2

            prise
cover      мягкая твердая
autor name
Островский    660       0
Тургеньев     650     450
Чехов           0     950